app/views/partials/_new_assignment_note_modal.html.erb

              <!-- <div style="margin-bottom: 25px" class="col-xs-12">
                <%= f.collection_select(:assignment_id, Assignment.all, :id, :name) %>
---
SELECT "assignments".* FROM "assignments"