app/views/partials/_view_posts_modal.html.erb

      <div class="modal-body">
        <% if Post.count == 0 %>
---
SELECT "posts".* FROM "posts"
SELECT COUNT(*) FROM "posts"


            <% Post.all.order(is_read: :asc, created_at: :desc).each do |post| %>
---
SELECT "posts".* FROM "posts" ORDER BY "posts"."is_read" ASC, "posts"."created_at" DESC

                    <br>
                    <span class="pull-left">Posted by <%= post.user.first_name %> <%= post.user.last_name %> on <%= post.created_at.localtime.strftime("%m.%d.%y") %> at <%= post.created_at.localtime.strftime("%l:%M %P") %></span>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]