app/controllers/assignments_controller.rb

SELECT "assignments".* FROM "assignments"
---
  def index
    if current_user.admin?
      @assignments = Assignment.all

INSERT INTO "assignments" ("name", "date_assigned", "assignment_stage", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Frosted Flakes"], ["date_assigned", 2016-11-22 00:00:00 UTC], ["assignment_stage", 0], ["user_id", 5], ["created_at", 2016-11-23 07:19:50 UTC], ["updated_at", 2016-11-23 07:19:50 UTC]]
---
  def create
    @assignment = current_user.assignments.create(assignment_params)