app/controllers/assignment_notes_controller.rb

SELECT  "assignments".* FROM "assignments" WHERE "assignments"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def new
    @assignment_note = AssignmentNote.new
    @assignment = Assignment.find(params[:assignment_id])