app/controllers/assignment_notes_controller.rb

  def create
    assignment = Assignment.find(params[:assignment_id])
    assignment_note = assignment.assignment_notes.new(assignment_note_params)

    assignment_note.user_id = current_user.id
    assignment_note.save
---
SELECT  "assignments".* FROM "assignments" WHERE "assignments"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
INSERT INTO "assignment_notes" ("text", "user_id", "assignment_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["text", "Does this still work?"], ["user_id", 5], ["assignment_id", 6], ["created_at", 2016-11-24 21:38:56 UTC], ["updated_at", 2016-11-24 21:38:56 UTC]]