app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "content", "is_read", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    if current_user.admin?
      @post = current_user.posts.create(post_params)

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "is_read" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["is_read", true], ["updated_at", 2016-11-26 00:21:12 UTC], ["id", 1]]
---
  def update
    @post = Post.find(params[:id])
    if @post.update_attributes(post_params)