app/controllers/posts_controller.rb

  def create
    post = User.find(params[:user_id]).posts.new(post_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 7], ["LIMIT", 1]]