app/controllers/tasks_controller.rb

  def update
    @task = current_user.tasks.find(params[:id]).update_attributes(task_params)
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."user_id" = ? AND "tasks"."id" = ? LIMIT ?  [["user_id", 5], ["id", 0], ["LIMIT", 1]]