app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = ? ORDER BY "tasks"."is_high_priority" DESC, "tasks"."created_at" DESC  [["user_id", 5]]
---
  def index
    @tasks = current_user.tasks.order(is_high_priority: :desc, created_at: :desc)

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."user_id" = ? AND "tasks"."id" = ? LIMIT ?  [["user_id", 5], ["id", 7], ["LIMIT", 1]]
---
  def show
    @task = current_user.tasks.find(params[:id])

INSERT INTO "tasks" ("text", "is_high_priority", "date_due", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["text", "Drink pool water"], ["is_high_priority", true], ["date_due", 2016-11-26 00:00:00 UTC], ["user_id", 5], ["created_at", 2016-11-22 17:02:36 UTC], ["updated_at", 2016-11-22 17:02:36 UTC]]
---
  def create
    @task = current_user.tasks.create(task_params)

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
---
  def update
    @task = Task.find(params[:id])

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 11]]
---
  def destroy
    @task = Task.find(params[:id])
    if @task.destroy